{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "units": 100, "use_bias": true, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "batch_input_shape": [null, 1500], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 6, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}}]}}, "training_config": {"loss_weights": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "RMSprop", "config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-07, "decay": 0.0}}, "metrics": ["accuracy"], "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "shape": [1500, 100], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [100, 6], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [6], "dtype": "float32"}]}]}