{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"name": "model_6", "output_layers": [["concatenate_1", 0, 0]], "input_layers": [["input_5", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, null, 50], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1d_1", "config": {"kernel_size": [5], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_constraint": null, "kernel_regularizer": null, "filters": 50, "trainable": true, "name": "conv1d_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "input_2", "config": {"name": "input_2", "sparse": false, "batch_input_shape": [null, null, 50], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_3", "config": {"name": "input_3", "sparse": false, "batch_input_shape": [null, null, 50], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "leaky_re_lu_1", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_1", "trainable": true}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv1d_3", "config": {"kernel_size": [5], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_constraint": null, "kernel_regularizer": null, "filters": 50, "trainable": true, "name": "conv1d_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_5", "config": {"kernel_size": [5], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_constraint": null, "kernel_regularizer": null, "filters": 50, "trainable": true, "name": "conv1d_5", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_2", "config": {"kernel_size": [5], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_constraint": null, "kernel_regularizer": null, "filters": 50, "trainable": true, "name": "conv1d_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "leaky_re_lu_3", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_3", "trainable": true}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "leaky_re_lu_5", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_5", "trainable": true}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "leaky_re_lu_2", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_2", "trainable": true}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv1d_4", "config": {"kernel_size": [5], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_constraint": null, "kernel_regularizer": null, "filters": 50, "trainable": true, "name": "conv1d_4", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_6", "config": {"kernel_size": [5], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_constraint": null, "kernel_regularizer": null, "filters": 50, "trainable": true, "name": "conv1d_6", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "use_bias": true, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "input_5", "config": {"name": "input_5", "sparse": false, "batch_input_shape": [null, null, 50], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_1", "config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 50, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "sigmoid"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "leaky_re_lu_4", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_4", "trainable": true}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "leaky_re_lu_6", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_6", "trainable": true}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["input_5", 0, 0, {}], ["dense_1", 0, 0, {}], ["leaky_re_lu_4", 0, 0, {}], ["leaky_re_lu_6", 0, 0, {}]]], "class_name": "Concatenate"}]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv1d_1/kernel", "shape": [5, 50, 50], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [50], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [5, 50, 50], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [50], "dtype": "float32"}, {"name": "conv1d_3/kernel", "shape": [5, 50, 50], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [50], "dtype": "float32"}, {"name": "conv1d_4/kernel", "shape": [5, 50, 50], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [50], "dtype": "float32"}, {"name": "conv1d_5/kernel", "shape": [5, 50, 50], "dtype": "float32"}, {"name": "conv1d_5/bias", "shape": [50], "dtype": "float32"}, {"name": "conv1d_6/kernel", "shape": [5, 50, 50], "dtype": "float32"}, {"name": "conv1d_6/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [50, 50], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [50], "dtype": "float32"}]}]}